app/Controllers/Item.php

    public function index()
    {
        if ($response = $this->requireLogin()) {
            return $response;
        }

        $data['items'] = $this->model->findAll();
---
SELECT *
FROM `items`