app/Controllers/Item.php

    public function index()
    {
        $model = new ItemModel();
        $data['items'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `items`
ORDER BY `id` DESC

    public function delete($id = null)
    {
        $model = new ItemModel();
        $model->delete($id);
---
DELETE FROM `items`
WHERE `id` IN ('2')