app/Controllers/Transaction.php

    public function index()
    {
        $model = new TransactionModel();
        $data['transactions'] = $model->getAllWithUser();

        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`