app/Models/TransactionModel.php

SELECT `distribution_logs`.*, `users`.`username` AS `user_name`, `items`.`nama_barang` AS `item_name`, `items`.`lokasi_loker`
FROM `distribution_logs`
LEFT JOIN `users` ON `users`.`id` = `distribution_logs`.`id_user`
LEFT JOIN `items` ON `items`.`id` = `distribution_logs`.`id_barang`
ORDER BY `tanggal_transaksi` DESC
---
    public function getAllWithUser()
    {
        return $this->select('distribution_logs.*, users.username AS user_name, items.nama_barang AS item_name, items.lokasi_loker')
            ->join('users', 'users.id = distribution_logs.id_user', 'left')
            ->join('items', 'items.id = distribution_logs.id_barang', 'left')
            ->orderBy('tanggal_transaksi', 'DESC')
            ->findAll();